renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx140/register_access/gnuc/iodefine.h
typedef struct st_cmt0 {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CKS : 2;
			unsigned short  : 4;
			unsigned short CMIE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short CMIE : 1;
			unsigned short  : 4;
			unsigned short CKS : 2;
#endif
	} BIT;
	} CMCR;
	unsigned short CMCNT;
	unsigned short CMCOR;
} st_cmt0_t;

typedef struct st_crc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char GPS : 2;
			unsigned char LMS : 1;
			unsigned char  : 4;
			unsigned char DORCLR : 1;
#else
			unsigned char DORCLR : 1;
			unsigned char  : 4;
			unsigned char LMS : 1;
			unsigned char GPS : 2;
#endif
	} BIT;
	} CRCCR;
	unsigned char  CRCDIR;
	unsigned short CRCDOR;
} st_crc_t;

typedef struct st_ctsu {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CTADCS : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long CTADCS : 1;
#endif
	} BIT;
	} CTSUADCC;
	char           wk0[508];
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STRT : 1;
			unsigned long CAP : 1;
			unsigned long SNZ : 1;
			unsigned long  : 1;
			unsigned long INIT : 1;
			unsigned long PUMPON : 1;
			unsigned long TXVSEL : 2;
			unsigned long PON : 1;
			unsigned long CSW : 1;
			unsigned long ATUNE0 : 1;
			unsigned long ATUNE1 : 1;
			unsigned long CLK : 2;
			unsigned long MD0 : 1;
			unsigned long MD1 : 1;
			unsigned long  : 1;
			unsigned long ATUNE2 : 1;
			unsigned long LOAD : 2;
			unsigned long POSEL : 2;
			unsigned long SDPSEL : 1;
			unsigned long PCSEL : 1;
			unsigned long STCLK : 6;
			unsigned long DCMODE : 1;
			unsigned long DCBACK : 1;
#else
			unsigned long DCBACK : 1;
			unsigned long DCMODE : 1;
			unsigned long STCLK : 6;
			unsigned long PCSEL : 1;
			unsigned long SDPSEL : 1;
			unsigned long POSEL : 2;
			unsigned long LOAD : 2;
			unsigned long ATUNE2 : 1;
			unsigned long  : 1;
			unsigned long MD1 : 1;
			unsigned long MD0 : 1;
			unsigned long CLK : 2;
			unsigned long ATUNE1 : 1;
			unsigned long ATUNE0 : 1;
			unsigned long CSW : 1;
			unsigned long PON : 1;
			unsigned long TXVSEL : 2;
			unsigned long PUMPON : 1;
			unsigned long INIT : 1;
			unsigned long  : 1;
			unsigned long SNZ : 1;
			unsigned long CAP : 1;
			unsigned long STRT : 1;
#endif
	} BIT;
	} CTSUCRA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PRRATIO : 4;
			unsigned long PRMODE : 2;
			unsigned long SOFF : 1;
			unsigned long PROFF : 1;
			unsigned long SST : 8;
			unsigned long  : 8;
			unsigned long SSMOD : 3;
			unsigned long  : 1;
			unsigned long SSCNT : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long SSCNT : 2;
			unsigned long  : 1;
			unsigned long SSMOD : 3;
			unsigned long  : 8;
			unsigned long SST : 8;
			unsigned long PROFF : 1;
			unsigned long SOFF : 1;
			unsigned long PRMODE : 2;
			unsigned long PRRATIO : 4;
#endif
	} BIT;
	} CTSUCRB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MCH0 : 6;
			unsigned long  : 2;
			unsigned long MCH1 : 6;
			unsigned long  : 2;
			unsigned long MCA0 : 1;
			unsigned long MCA1 : 1;
			unsigned long MCA2 : 1;
			unsigned long MCA3 : 1;
			unsigned long  : 12;
#else
			unsigned long  : 12;
			unsigned long MCA3 : 1;
			unsigned long MCA2 : 1;
			unsigned long MCA1 : 1;
			unsigned long MCA0 : 1;
			unsigned long  : 2;
			unsigned long MCH1 : 6;
			unsigned long  : 2;
			unsigned long MCH0 : 6;
#endif
	} BIT;
	} CTSUMCH;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CHAC0 : 1;
			unsigned long CHAC1 : 1;
			unsigned long CHAC2 : 1;
			unsigned long CHAC3 : 1;
			unsigned long CHAC4 : 1;
			unsigned long CHAC5 : 1;
			unsigned long CHAC6 : 1;
			unsigned long CHAC7 : 1;
			unsigned long CHAC8 : 1;
			unsigned long CHAC9 : 1;
			unsigned long CHAC10 : 1;
			unsigned long CHAC11 : 1;
			unsigned long CHAC12 : 1;
			unsigned long CHAC13 : 1;
			unsigned long CHAC14 : 1;
			unsigned long CHAC15 : 1;
			unsigned long CHAC16 : 1;
			unsigned long CHAC17 : 1;
			unsigned long CHAC18 : 1;
			unsigned long CHAC19 : 1;
			unsigned long CHAC20 : 1;
			unsigned long CHAC21 : 1;
			unsigned long CHAC22 : 1;
			unsigned long CHAC23 : 1;
			unsigned long CHAC24 : 1;
			unsigned long CHAC25 : 1;
			unsigned long CHAC26 : 1;
			unsigned long CHAC27 : 1;
			unsigned long CHAC28 : 1;
			unsigned long CHAC29 : 1;
			unsigned long CHAC30 : 1;
			unsigned long CHAC31 : 1;
#else
			unsigned long CHAC31 : 1;
			unsigned long CHAC30 : 1;
			unsigned long CHAC29 : 1;
			unsigned long CHAC28 : 1;
			unsigned long CHAC27 : 1;
			unsigned long CHAC26 : 1;
			unsigned long CHAC25 : 1;
			unsigned long CHAC24 : 1;
			unsigned long CHAC23 : 1;
			unsigned long CHAC22 : 1;
			unsigned long CHAC21 : 1;
			unsigned long CHAC20 : 1;
			unsigned long CHAC19 : 1;
			unsigned long CHAC18 : 1;
			unsigned long CHAC17 : 1;
			unsigned long CHAC16 : 1;
			unsigned long CHAC15 : 1;
			unsigned long CHAC14 : 1;
			unsigned long CHAC13 : 1;
			unsigned long CHAC12 : 1;
			unsigned long CHAC11 : 1;
			unsigned long CHAC10 : 1;
			unsigned long CHAC9 : 1;
			unsigned long CHAC8 : 1;
			unsigned long CHAC7 : 1;
			unsigned long CHAC6 : 1;
			unsigned long CHAC5 : 1;
			unsigned long CHAC4 : 1;
			unsigned long CHAC3 : 1;
			unsigned long CHAC2 : 1;
			unsigned long CHAC1 : 1;
			unsigned long CHAC0 : 1;
#endif
	} BIT;
	} CTSUCHACA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CHAC32 : 1;
			unsigned long CHAC33 : 1;
			unsigned long CHAC34 : 1;
			unsigned long CHAC35 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long CHAC35 : 1;
			unsigned long CHAC34 : 1;
			unsigned long CHAC33 : 1;
			unsigned long CHAC32 : 1;
#endif
	} BIT;
	} CTSUCHACB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CHTRC0 : 1;
			unsigned long CHTRC1 : 1;
			unsigned long CHTRC2 : 1;
			unsigned long CHTRC3 : 1;
			unsigned long CHTRC4 : 1;
			unsigned long CHTRC5 : 1;
			unsigned long CHTRC6 : 1;
			unsigned long CHTRC7 : 1;
			unsigned long CHTRC8 : 1;
			unsigned long CHTRC9 : 1;
			unsigned long CHTRC10 : 1;
			unsigned long CHTRC11 : 1;
			unsigned long CHTRC12 : 1;
			unsigned long CHTRC13 : 1;
			unsigned long CHTRC14 : 1;
			unsigned long CHTRC15 : 1;
			unsigned long CHTRC16 : 1;
			unsigned long CHTRC17 : 1;
			unsigned long CHTRC18 : 1;
			unsigned long CHTRC19 : 1;
			unsigned long CHTRC20 : 1;
			unsigned long CHTRC21 : 1;
			unsigned long CHTRC22 : 1;
			unsigned long CHTRC23 : 1;
			unsigned long CHTRC24 : 1;
			unsigned long CHTRC25 : 1;
			unsigned long CHTRC26 : 1;
			unsigned long CHTRC27 : 1;
			unsigned long CHTRC28 : 1;
			unsigned long CHTRC29 : 1;
			unsigned long CHTRC30 : 1;
			unsigned long CHTRC31 : 1;
#else
			unsigned long CHTRC31 : 1;
			unsigned long CHTRC30 : 1;
			unsigned long CHTRC29 : 1;
			unsigned long CHTRC28 : 1;
			unsigned long CHTRC27 : 1;
			unsigned long CHTRC26 : 1;
			unsigned long CHTRC25 : 1;
			unsigned long CHTRC24 : 1;
			unsigned long CHTRC23 : 1;
			unsigned long CHTRC22 : 1;
			unsigned long CHTRC21 : 1;
			unsigned long CHTRC20 : 1;
			unsigned long CHTRC19 : 1;
			unsigned long CHTRC18 : 1;
			unsigned long CHTRC17 : 1;
			unsigned long CHTRC16 : 1;
			unsigned long CHTRC15 : 1;
			unsigned long CHTRC14 : 1;
			unsigned long CHTRC13 : 1;
			unsigned long CHTRC12 : 1;
			unsigned long CHTRC11 : 1;
			unsigned long CHTRC10 : 1;
			unsigned long CHTRC9 : 1;
			unsigned long CHTRC8 : 1;
			unsigned long CHTRC7 : 1;
			unsigned long CHTRC6 : 1;
			unsigned long CHTRC5 : 1;
			unsigned long CHTRC4 : 1;
			unsigned long CHTRC3 : 1;
			unsigned long CHTRC2 : 1;
			unsigned long CHTRC1 : 1;
			unsigned long CHTRC0 : 1;
#endif
	} BIT;
	} CTSUCHTRCA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CHTRC32 : 1;
			unsigned long CHTRC33 : 1;
			unsigned long CHTRC34 : 1;
			unsigned long CHTRC35 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long CHTRC35 : 1;
			unsigned long CHTRC34 : 1;
			unsigned long CHTRC33 : 1;
			unsigned long CHTRC32 : 1;
#endif
	} BIT;
	} CTSUCHTRCB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MFC : 2;
			unsigned long  : 3;
			unsigned long ICOMPRST : 1;
			unsigned long ICOMP1 : 1;
			unsigned long ICOMP0 : 1;
			unsigned long STC : 3;
			unsigned long  : 1;
			unsigned long DTSR : 1;
			unsigned long SCOVF : 1;
			unsigned long UCOVF : 1;
			unsigned long PS : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long PS : 1;
			unsigned long UCOVF : 1;
			unsigned long SCOVF : 1;
			unsigned long DTSR : 1;
			unsigned long  : 1;
			unsigned long STC : 3;
			unsigned long ICOMP0 : 1;
			unsigned long ICOMP1 : 1;
			unsigned long ICOMPRST : 1;
			unsigned long  : 3;
			unsigned long MFC : 2;
#endif
	} BIT;
	} CTSUSR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SO : 10;
			unsigned long SNUM : 8;
			unsigned long  : 2;
			unsigned long SSDIV : 4;
			unsigned long SDPA : 8;
#else
			unsigned long SDPA : 8;
			unsigned long SSDIV : 4;
			unsigned long  : 2;
			unsigned long SNUM : 8;
			unsigned long SO : 10;
#endif
	} BIT;
	} CTSUSO;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SC : 16;
			unsigned long UC : 16;
#else
			unsigned long UC : 16;
			unsigned long SC : 16;
#endif
	} BIT;
	} CTSUSCNT;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 2;
			unsigned long TSOD : 1;
			unsigned long DRV : 1;
			unsigned long CLKSEL : 2;
			unsigned long SUCLKEN : 1;
			unsigned long TSOC : 1;
			unsigned long CNTRDSEL : 1;
			unsigned long IOC : 1;
			unsigned long  : 1;
			unsigned long DCOFF : 1;
			unsigned long IOCSEL : 1;
			unsigned long  : 11;
			unsigned long DACMSEL : 1;
			unsigned long DACCARRY : 1;
			unsigned long SUMSEL : 1;
			unsigned long SUCARRY : 1;
			unsigned long DACCLK : 1;
			unsigned long CCOCLK : 1;
			unsigned long CCOCALIB : 1;
			unsigned long TXREV : 1;
#else
			unsigned long TXREV : 1;
			unsigned long CCOCALIB : 1;
			unsigned long CCOCLK : 1;
			unsigned long DACCLK : 1;
			unsigned long SUCARRY : 1;
			unsigned long SUMSEL : 1;
			unsigned long DACCARRY : 1;
			unsigned long DACMSEL : 1;
			unsigned long  : 11;
			unsigned long IOCSEL : 1;
			unsigned long DCOFF : 1;
			unsigned long  : 1;
			unsigned long IOC : 1;
			unsigned long CNTRDSEL : 1;
			unsigned long TSOC : 1;
			unsigned long SUCLKEN : 1;
			unsigned long CLKSEL : 2;
			unsigned long DRV : 1;
			unsigned long TSOD : 1;
			unsigned long  : 2;
#endif
	} BIT;
	} CTSUCALIB;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SUADJ0 : 8;
			unsigned long SUMULTI0 : 8;
			unsigned long SUADJ1 : 8;
			unsigned long SUMULTI1 : 8;
#else
			unsigned long SUMULTI1 : 8;
			unsigned long SUADJ1 : 8;
			unsigned long SUMULTI0 : 8;
			unsigned long SUADJ0 : 8;
#endif
	} BIT;
	} CTSUSUCLKA;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SUADJ2 : 8;
			unsigned long SUMULTI2 : 8;
			unsigned long SUADJ3 : 8;
			unsigned long SUMULTI3 : 8;
#else
			unsigned long SUMULTI3 : 8;
			unsigned long SUADJ3 : 8;
			unsigned long SUMULTI2 : 8;
			unsigned long SUADJ2 : 8;
#endif
	} BIT;
	} CTSUSUCLKB;
	char           wk1[12];
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CCOCFEN : 1;
			unsigned long  : 3;
			unsigned long DTCLESS : 1;
			unsigned long MTUCFEN : 1;
			unsigned long  : 2;
			unsigned long AJFEN : 1;
			unsigned long  : 7;
			unsigned long SCACTB : 4;
			unsigned long  : 12;
#else
			unsigned long  : 12;
			unsigned long SCACTB : 4;
			unsigned long  : 7;
			unsigned long AJFEN : 1;
			unsigned long  : 2;
			unsigned long MTUCFEN : 1;
			unsigned long DTCLESS : 1;
			unsigned long  : 3;
			unsigned long CCOCFEN : 1;
#endif
	} BIT;
	} CTSUOPT;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SCNTACCOEFF : 16;
			unsigned long SCNTACCOUNT : 16;
#else
			unsigned long SCNTACCOUNT : 16;
			unsigned long SCNTACCOEFF : 16;
#endif
	} BIT;
	} CTSUSCNTACT;
	char           wk2[16];
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TLOT : 8;
			unsigned long THOT : 8;
			unsigned long BLINI : 1;
			unsigned long  : 3;
			unsigned long JC : 2;
			unsigned long  : 2;
			unsigned long AJMMAT : 4;
			unsigned long AJBMAT : 4;
#else
			unsigned long AJBMAT : 4;
			unsigned long AJMMAT : 4;
			unsigned long  : 2;
			unsigned long JC : 2;
			unsigned long  : 3;
			unsigned long BLINI : 1;
			unsigned long THOT : 8;
			unsigned long TLOT : 8;
#endif
	} BIT;
	} CTSUAJCR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long AJTHL : 16;
			unsigned long AJTHH : 16;
#else
			unsigned long AJTHH : 16;
			unsigned long AJTHL : 16;
#endif
	} BIT;
	} CTSUAJTHR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long AJMMATI : 4;
			unsigned long  : 1;
			unsigned long AJMMAR : 27;
#else
			unsigned long AJMMAR : 27;
			unsigned long  : 1;
			unsigned long AJMMATI : 4;
#endif
	} BIT;
	} CTSUAJMMAR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long AJBLACT : 32;
#else
			unsigned long AJBLACT : 32;
#endif
	} BIT;
	} CTSUAJBLACT;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long AJBLAC : 16;
			unsigned long AJBLAR : 16;
#else
			unsigned long AJBLAR : 16;
			unsigned long AJBLAC : 16;
#endif
	} BIT;
	} CTSUAJBLAR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TJR0 : 1;
			unsigned long TJR1 : 1;
			unsigned long TJR2 : 1;
			unsigned long TJR3 : 1;
			unsigned long FJR : 1;
			unsigned long  : 3;
			unsigned long SJCCR : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long SJCCR : 8;
			unsigned long  : 3;
			unsigned long FJR : 1;
			unsigned long TJR3 : 1;
			unsigned long TJR2 : 1;
			unsigned long TJR1 : 1;
			unsigned long TJR0 : 1;
#endif
	} BIT;
	} CTSUAJRR;
	char           wk3[7715380];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RTRIM : 8;
			unsigned long DACTRIM : 8;
			unsigned long SUADJD : 8;
			unsigned long TRESULT4 : 8;
#else
			unsigned long TRESULT4 : 8;
			unsigned long SUADJD : 8;
			unsigned long DACTRIM : 8;
			unsigned long RTRIM : 8;
#endif
	} BIT;
	} CTSUTRIMA;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TRESULT0 : 8;
			unsigned long TRESULT1 : 8;
			unsigned long TRESULT2 : 8;
			unsigned long TRESULT3 : 8;
#else
			unsigned long TRESULT3 : 8;
			unsigned long TRESULT2 : 8;
			unsigned long TRESULT1 : 8;
			unsigned long TRESULT0 : 8;
#endif
	} BIT;
	} CTSUTRIMB;
} st_ctsu_t;

typedef struct st_da {
	unsigned short DADR0;
	unsigned short DADR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 6;
			unsigned char DAOE0 : 1;
			unsigned char DAOE1 : 1;
#else
			unsigned char DAOE1 : 1;
			unsigned char DAOE0 : 1;
			unsigned char  : 6;
#endif
	} BIT;
	} DACR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 7;
			unsigned char DPSEL : 1;
#else
			unsigned char DPSEL : 1;
			unsigned char  : 7;
#endif
	} BIT;
	} DADPR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 7;
			unsigned char DAADST : 1;
#else
			unsigned char DAADST : 1;
			unsigned char  : 7;
#endif
	} BIT;
	} DAADSCR;
} st_da_t;

typedef struct st_doc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OMS : 2;
			unsigned char DCSEL : 1;
			unsigned char  : 1;
			unsigned char DOPCIE : 1;
			unsigned char DOPCF : 1;
			unsigned char DOPCFCL : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char DOPCFCL : 1;
			unsigned char DOPCF : 1;
			unsigned char DOPCIE : 1;
			unsigned char  : 1;
			unsigned char DCSEL : 1;
			unsigned char OMS : 2;
#endif
	} BIT;
	} DOCR;
	char           wk0[1];
	unsigned short DODIR;
	unsigned short DODSR;
} st_doc_t;

typedef struct st_dtc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 4;
			unsigned char RRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char RRS : 1;
			unsigned char  : 4;
#endif
	} BIT;
	} DTCCR;
	char           wk0[3];
	void          *DTCVBR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SHORT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SHORT : 1;
#endif
	} BIT;
	} DTCADMOD;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTCST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTCST : 1;
#endif
	} BIT;
	} DTCST;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short VECN : 8;
			unsigned short  : 7;
			unsigned short ACT : 1;
#else
			unsigned short ACT : 1;
			unsigned short  : 7;
			unsigned short VECN : 8;
#endif
	} BIT;
	} DTCSTS;
	void          *DTCIBR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SQTFRL : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SQTFRL : 1;
#endif
	} BIT;
	} DTCOR;
	char           wk3[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short VECN : 8;
			unsigned short  : 7;
			unsigned short ESPSEL : 1;
#else
			unsigned short ESPSEL : 1;
			unsigned short  : 7;
			unsigned short VECN : 8;
#endif
	} BIT;
	} DTCSQE;
	unsigned long  DTCDISP;
} st_dtc_t;

typedef struct st_elc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 7;
			unsigned char ELCON : 1;
#else
			unsigned char ELCON : 1;
			unsigned char  : 7;
#endif
	} BIT;
	} ELCR;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR4;
	char           wk1[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR8;
	char           wk2[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR10;
	char           wk3[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR12;
	char           wk4[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR14;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR15;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR16;
	char           wk5[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR18;
	char           wk6[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR20;
	char           wk7[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR22;
	char           wk8[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR24;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ELS : 8;
#else
			unsigned char ELS : 8;
#endif
	} BIT;
	} ELSR25;
	char           wk9[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 2;
			unsigned char MTU1MD : 2;
			unsigned char MTU2MD : 2;
			unsigned char MTU3MD : 2;
#else
			unsigned char MTU3MD : 2;
			unsigned char MTU2MD : 2;
			unsigned char MTU1MD : 2;
			unsigned char  : 2;
#endif
	} BIT;
	} ELOPA;
	union {
		unsigned char BYTE;
		struct {
			
