renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx140/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLFDP0 : 1;
			unsigned short GAFLFDP1 : 1;
			unsigned short  : 2;
			unsigned short GAFLFDP4 : 1;
			unsigned short  : 3;
			unsigned short GAFLRMDP : 7;
			unsigned short GAFLRMV : 1;
#else
			unsigned short GAFLRMV : 1;
			unsigned short GAFLRMDP : 7;
			unsigned short  : 3;
			unsigned short GAFLFDP4 : 1;
			unsigned short  : 2;
			unsigned short GAFLFDP1 : 1;
			unsigned short GAFLFDP0 : 1;
#endif
	} BIT;
		} GAFLPL14;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 16;
#else
			unsigned short RMID : 16;
#endif
	} BIT;
		} RMIDL11;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLPTR : 12;
			unsigned short GAFLDLC : 4;
#else
			unsigned short GAFLDLC : 4;
			unsigned short GAFLPTR : 12;
#endif
	} BIT;
		} GAFLPH14;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 13;
			unsigned short  : 1;
			unsigned short RMRTR : 1;
			unsigned short RMIDE : 1;
#else
			unsigned short RMIDE : 1;
			unsigned short RMRTR : 1;
			unsigned short  : 1;
			unsigned short RMID : 13;
#endif
	} BIT;
		} RMIDH11;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLID : 16;
#else
			unsigned short GAFLID : 16;
#endif
	} BIT;
		} GAFLIDL15;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMTS : 16;
#else
			unsigned short RMTS : 16;
#endif
	} BIT;
		} RMTS11;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLID : 13;
			unsigned short GAFLLB : 1;
			unsigned short GAFLRTR : 1;
			unsigned short GAFLIDE : 1;
#else
			unsigned short GAFLIDE : 1;
			unsigned short GAFLRTR : 1;
			unsigned short GAFLLB : 1;
			unsigned short GAFLID : 13;
#endif
	} BIT;
		} GAFLIDH15;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMPTR : 12;
			unsigned short RMDLC : 4;
#else
			unsigned short RMDLC : 4;
			unsigned short RMPTR : 12;
#endif
	} BIT;
		} RMPTR11;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLIDM : 16;
#else
			unsigned short GAFLIDM : 16;
#endif
	} BIT;
		} GAFLML15;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB0 : 8;
			unsigned short RMDB1 : 8;
#else
			unsigned short RMDB1 : 8;
			unsigned short RMDB0 : 8;
#endif
	} BIT;
		} RMDF011;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLIDM : 13;
			unsigned short  : 1;
			unsigned short GAFLRTRM : 1;
			unsigned short GAFLIDEM : 1;
#else
			unsigned short GAFLIDEM : 1;
			unsigned short GAFLRTRM : 1;
			unsigned short  : 1;
			unsigned short GAFLIDM : 13;
#endif
	} BIT;
		} GAFLMH15;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB2 : 8;
			unsigned short RMDB3 : 8;
#else
			unsigned short RMDB3 : 8;
			unsigned short RMDB2 : 8;
#endif
	} BIT;
		} RMDF111;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLFDP0 : 1;
			unsigned short GAFLFDP1 : 1;
			unsigned short  : 2;
			unsigned short GAFLFDP4 : 1;
			unsigned short  : 3;
			unsigned short GAFLRMDP : 7;
			unsigned short GAFLRMV : 1;
#else
			unsigned short GAFLRMV : 1;
			unsigned short GAFLRMDP : 7;
			unsigned short  : 3;
			unsigned short GAFLFDP4 : 1;
			unsigned short  : 2;
			unsigned short GAFLFDP1 : 1;
			unsigned short GAFLFDP0 : 1;
#endif
	} BIT;
		} GAFLPL15;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB4 : 8;
			unsigned short RMDB5 : 8;
#else
			unsigned short RMDB5 : 8;
			unsigned short RMDB4 : 8;
#endif
	} BIT;
		} RMDF211;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GAFLPTR : 12;
			unsigned short GAFLDLC : 4;
#else
			unsigned short GAFLDLC : 4;
			unsigned short GAFLPTR : 12;
#endif
	} BIT;
		} GAFLPH15;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB6 : 8;
			unsigned short RMDB7 : 8;
#else
			unsigned short RMDB7 : 8;
			unsigned short RMDB6 : 8;
#endif
	} BIT;
		} RMDF311;
	};
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 16;
#else
			unsigned short RMID : 16;
#endif
	} BIT;
	} RMIDL12;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 13;
			unsigned short  : 1;
			unsigned short RMRTR : 1;
			unsigned short RMIDE : 1;
#else
			unsigned short RMIDE : 1;
			unsigned short RMRTR : 1;
			unsigned short  : 1;
			unsigned short RMID : 13;
#endif
	} BIT;
	} RMIDH12;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMTS : 16;
#else
			unsigned short RMTS : 16;
#endif
	} BIT;
	} RMTS12;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMPTR : 12;
			unsigned short RMDLC : 4;
#else
			unsigned short RMDLC : 4;
			unsigned short RMPTR : 12;
#endif
	} BIT;
	} RMPTR12;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB0 : 8;
			unsigned short RMDB1 : 8;
#else
			unsigned short RMDB1 : 8;
			unsigned short RMDB0 : 8;
#endif
	} BIT;
	} RMDF012;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB2 : 8;
			unsigned short RMDB3 : 8;
#else
			unsigned short RMDB3 : 8;
			unsigned short RMDB2 : 8;
#endif
	} BIT;
	} RMDF112;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB4 : 8;
			unsigned short RMDB5 : 8;
#else
			unsigned short RMDB5 : 8;
			unsigned short RMDB4 : 8;
#endif
	} BIT;
	} RMDF212;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB6 : 8;
			unsigned short RMDB7 : 8;
#else
			unsigned short RMDB7 : 8;
			unsigned short RMDB6 : 8;
#endif
	} BIT;
	} RMDF312;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 16;
#else
			unsigned short RMID : 16;
#endif
	} BIT;
	} RMIDL13;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 13;
			unsigned short  : 1;
			unsigned short RMRTR : 1;
			unsigned short RMIDE : 1;
#else
			unsigned short RMIDE : 1;
			unsigned short RMRTR : 1;
			unsigned short  : 1;
			unsigned short RMID : 13;
#endif
	} BIT;
	} RMIDH13;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMTS : 16;
#else
			unsigned short RMTS : 16;
#endif
	} BIT;
	} RMTS13;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMPTR : 12;
			unsigned short RMDLC : 4;
#else
			unsigned short RMDLC : 4;
			unsigned short RMPTR : 12;
#endif
	} BIT;
	} RMPTR13;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB0 : 8;
			unsigned short RMDB1 : 8;
#else
			unsigned short RMDB1 : 8;
			unsigned short RMDB0 : 8;
#endif
	} BIT;
	} RMDF013;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB2 : 8;
			unsigned short RMDB3 : 8;
#else
			unsigned short RMDB3 : 8;
			unsigned short RMDB2 : 8;
#endif
	} BIT;
	} RMDF113;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB4 : 8;
			unsigned short RMDB5 : 8;
#else
			unsigned short RMDB5 : 8;
			unsigned short RMDB4 : 8;
#endif
	} BIT;
	} RMDF213;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB6 : 8;
			unsigned short RMDB7 : 8;
#else
			unsigned short RMDB7 : 8;
			unsigned short RMDB6 : 8;
#endif
	} BIT;
	} RMDF313;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 16;
#else
			unsigned short RMID : 16;
#endif
	} BIT;
	} RMIDL14;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 13;
			unsigned short  : 1;
			unsigned short RMRTR : 1;
			unsigned short RMIDE : 1;
#else
			unsigned short RMIDE : 1;
			unsigned short RMRTR : 1;
			unsigned short  : 1;
			unsigned short RMID : 13;
#endif
	} BIT;
	} RMIDH14;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMTS : 16;
#else
			unsigned short RMTS : 16;
#endif
	} BIT;
	} RMTS14;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMPTR : 12;
			unsigned short RMDLC : 4;
#else
			unsigned short RMDLC : 4;
			unsigned short RMPTR : 12;
#endif
	} BIT;
	} RMPTR14;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB0 : 8;
			unsigned short RMDB1 : 8;
#else
			unsigned short RMDB1 : 8;
			unsigned short RMDB0 : 8;
#endif
	} BIT;
	} RMDF014;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB2 : 8;
			unsigned short RMDB3 : 8;
#else
			unsigned short RMDB3 : 8;
			unsigned short RMDB2 : 8;
#endif
	} BIT;
	} RMDF114;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB4 : 8;
			unsigned short RMDB5 : 8;
#else
			unsigned short RMDB5 : 8;
			unsigned short RMDB4 : 8;
#endif
	} BIT;
	} RMDF214;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB6 : 8;
			unsigned short RMDB7 : 8;
#else
			unsigned short RMDB7 : 8;
			unsigned short RMDB6 : 8;
#endif
	} BIT;
	} RMDF314;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 16;
#else
			unsigned short RMID : 16;
#endif
	} BIT;
	} RMIDL15;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMID : 13;
			unsigned short  : 1;
			unsigned short RMRTR : 1;
			unsigned short RMIDE : 1;
#else
			unsigned short RMIDE : 1;
			unsigned short RMRTR : 1;
			unsigned short  : 1;
			unsigned short RMID : 13;
#endif
	} BIT;
	} RMIDH15;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMTS : 16;
#else
			unsigned short RMTS : 16;
#endif
	} BIT;
	} RMTS15;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMPTR : 12;
			unsigned short RMDLC : 4;
#else
			unsigned short RMDLC : 4;
			unsigned short RMPTR : 12;
#endif
	} BIT;
	} RMPTR15;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB0 : 8;
			unsigned short RMDB1 : 8;
#else
			unsigned short RMDB1 : 8;
			unsigned short RMDB0 : 8;
#endif
	} BIT;
	} RMDF015;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB2 : 8;
			unsigned short RMDB3 : 8;
#else
			unsigned short RMDB3 : 8;
			unsigned short RMDB2 : 8;
#endif
	} BIT;
	} RMDF115;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB4 : 8;
			unsigned short RMDB5 : 8;
#else
			unsigned short RMDB5 : 8;
			unsigned short RMDB4 : 8;
#endif
	} BIT;
	} RMDF215;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RMDB6 : 8;
			unsigned short RMDB7 : 8;
#else
			unsigned short RMDB7 : 8;
			unsigned short RMDB6 : 8;
#endif
	} BIT;
	} RMDF315;
	char           wk9[224];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC0;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC6;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC7;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC8;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC9;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC10;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC11;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC12;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC13;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC14;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC15;
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFID : 16;
#else
			unsigned short RFID : 16;
#endif
	} BIT;
		} RFIDL0;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC16;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFID : 13;
			unsigned short  : 1;
			unsigned short RFRTR : 1;
			unsigned short RFIDE : 1;
#else
			unsigned short RFIDE : 1;
			unsigned short RFRTR : 1;
			unsigned short  : 1;
			unsigned short RFID : 13;
#endif
	} BIT;
		} RFIDH0;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC17;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFTS : 16;
#else
			unsigned short RFTS : 16;
#endif
	} BIT;
		} RFTS0;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC18;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFPTR : 12;
			unsigned short RFDLC : 4;
#else
			unsigned short RFDLC : 4;
			unsigned short RFPTR : 12;
#endif
	} BIT;
		} RFPTR0;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC19;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB0 : 8;
			unsigned short RFDB1 : 8;
#else
			unsigned short RFDB1 : 8;
			unsigned short RFDB0 : 8;
#endif
	} BIT;
		} RFDF00;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC20;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB2 : 8;
			unsigned short RFDB3 : 8;
#else
			unsigned short RFDB3 : 8;
			unsigned short RFDB2 : 8;
#endif
	} BIT;
		} RFDF10;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC21;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB4 : 8;
			unsigned short RFDB5 : 8;
#else
			unsigned short RFDB5 : 8;
			unsigned short RFDB4 : 8;
#endif
	} BIT;
		} RFDF20;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC22;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB6 : 8;
			unsigned short RFDB7 : 8;
#else
			unsigned short RFDB7 : 8;
			unsigned short RFDB6 : 8;
#endif
	} BIT;
		} RFDF30;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC23;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFID : 16;
#else
			unsigned short RFID : 16;
#endif
	} BIT;
		} RFIDL1;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC24;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFID : 13;
			unsigned short  : 1;
			unsigned short RFRTR : 1;
			unsigned short RFIDE : 1;
#else
			unsigned short RFIDE : 1;
			unsigned short RFRTR : 1;
			unsigned short  : 1;
			unsigned short RFID : 13;
#endif
	} BIT;
		} RFIDH1;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC25;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFTS : 16;
#else
			unsigned short RFTS : 16;
#endif
	} BIT;
		} RFTS1;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC26;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFPTR : 12;
			unsigned short RFDLC : 4;
#else
			unsigned short RFDLC : 4;
			unsigned short RFPTR : 12;
#endif
	} BIT;
		} RFPTR1;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC27;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB0 : 8;
			unsigned short RFDB1 : 8;
#else
			unsigned short RFDB1 : 8;
			unsigned short RFDB0 : 8;
#endif
	} BIT;
		} RFDF01;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC28;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB2 : 8;
			unsigned short RFDB3 : 8;
#else
			unsigned short RFDB3 : 8;
			unsigned short RFDB2 : 8;
#endif
	} BIT;
		} RFDF11;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC29;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB4 : 8;
			unsigned short RFDB5 : 8;
#else
			unsigned short RFDB5 : 8;
			unsigned short RFDB4 : 8;
#endif
	} BIT;
		} RFDF21;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC30;
	};
	union {
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RFDB6 : 8;
			unsigned short RFDB7 : 8;
#else
			unsigned short RFDB7 : 8;
			unsigned short RFDB6 : 8;
#endif
	} BIT;
		} RFDF31;
		union {
			unsigned short WORD;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
		} RPGACC31;
	};
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC32;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC33;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC34;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC35;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC36;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC37;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC38;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC39;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC40;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short RDTA : 16;
#else
			unsigned short RDTA : 16;
#endif
	} BIT;
	} RPGACC41;
	union {
		unsigned short WORD;
		struct {
			
